AudioStreamingPlatform/mbed-os/targets/TARGET_STM/TARGET_STM32L4/serial_device.c
typedef void(*DmaCompleteCallback)(uint32_t);

DmaCompleteCallback callback_dma_rx;
uint32_t callback_id_dma_rx;

DmaCompleteCallback callback_dma_tx;
uint32_t callback_id_dma_tx;

void HAL_UART_RxCpltCallback(UART_HandleTypeDef* UartHandle)
{
    /* Set transmission flag: transfer complete*/
    serial_idle_callback();
}

void HAL_UART_TxCpltCallback(UART_HandleTypeDef* UartHandle)
{
    if (callback_dma_tx) {
        callback_dma_tx(callback_id_dma_tx);
    }
}

void serial_idle_callback(void)
{
    if (callback_dma_rx) {
        callback_dma_rx(callback_id_dma_rx);
    }
}

static void uart1_irq_idle(void)
{
    int8_t id = get_uart_index(UART_1);

    if (id >= 0) {
        UART_HandleTypeDef* huart = &uart_handlers[id];

        if (__HAL_UART_GET_FLAG(huart, UART_FLAG_IDLE) != RESET) {
            if (__HAL_UART_GET_IT(huart, UART_IT_IDLE) != RESET) {
                __HAL_UART_CLEAR_FLAG(huart, UART_FLAG_IDLE);
                serial_idle_callback();
            }
        }

        if (__HAL_UART_GET_FLAG(huart, UART_FLAG_TC) != RESET) {
            if(__HAL_UART_GET_IT(huart, UART_IT_TC) != RESET) {
                __HAL_UART_CLEAR_FLAG(huart, UART_FLAG_TC);
                huart->gState = HAL_UART_STATE_READY;
            }
        }
    }
}

void serial_rx_dma_init(serial_t *obj, DMA_HandleTypeDef *hdma_rx, uint8_t* buffer, size_t buffer_size, void(*DmaCompleteCallback)(uint32_t), uint32_t id)
{
    __HAL_RCC_DMA1_CLK_ENABLE();
    /* Configure the DMA handler for reception process */
    hdma_rx->Instance                 = DMA1_Channel5;
    hdma_rx->Init.Direction           = DMA_PERIPH_TO_MEMORY;
    hdma_rx->Init.PeriphInc           = DMA_PINC_DISABLE;
    hdma_rx->Init.MemInc              = DMA_MINC_ENABLE;
    hdma_rx->Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    hdma_rx->Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
    hdma_rx->Init.Mode                = DMA_CIRCULAR;
    hdma_rx->Init.Priority            = DMA_PRIORITY_HIGH;
    hdma_rx->Init.Request             = DMA_REQUEST_2;

    HAL_DMA_Init(hdma_rx);

    struct serial_s *obj_s = SERIAL_S(obj);
    UART_HandleTypeDef *huart = &uart_handlers[obj_s->index];
    /* Associate the initialized DMA handle to the the UART handle */
    __HAL_LINKDMA(huart, hdmarx, *hdma_rx);
    dmauart = huart;
    /*##-4- Configure the NVIC for DMA #########################################*/
    /* NVIC configuration for DMA transfer complete interrupt (USART1_RX) */
    HAL_NVIC_SetPriority(DMA1_Channel5_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(DMA1_Channel5_IRQn);


    __HAL_UART_ENABLE_IT(huart, UART_IT_IDLE);
    __HAL_UART_DISABLE_IT(huart, UART_IT_RXNE);
    uint32_t vector = (uint32_t)&uart1_irq_idle;
    NVIC_SetVector(USART1_IRQn, vector);
    NVIC_EnableIRQ(USART1_IRQn);
    if(HAL_UART_Receive_DMA(huart, (uint8_t *)buffer, buffer_size) != HAL_OK)
    {

    }

    callback_dma_rx = DmaCompleteCallback;
    callback_id_dma_rx = (uint32_t)id;
}

size_t serial_get_dma_rx_position(serial_t *obj)
{
    struct serial_s *obj_s = SERIAL_S(obj);
    UART_HandleTypeDef *huart = &uart_handlers[obj_s->index];

    return huart->hdmarx->Instance->CNDTR;
}

void serial_tx_dma_init(serial_t *obj, DMA_HandleTypeDef *hdma_tx, void(*DmaCompleteCallback)(uint32_t), uint32_t id)
{
    /* USART1_TX Init */
    hdma_tx->Instance = DMA1_Channel4;
    hdma_tx->Init.Request = DMA_REQUEST_2;
    hdma_tx->Init.Direction = DMA_MEMORY_TO_PERIPH;
    hdma_tx->Init.PeriphInc = DMA_PINC_DISABLE;
    hdma_tx->Init.MemInc = DMA_MINC_ENABLE;
    hdma_tx->Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    hdma_tx->Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    hdma_tx->Init.Mode = DMA_NORMAL;
    hdma_tx->Init.Priority = DMA_PRIORITY_LOW;
    HAL_DMA_Init(hdma_tx);

    struct serial_s *obj_s = SERIAL_S(obj);
    UART_HandleTypeDef *huart = &uart_handlers[obj_s->index];

    __HAL_LINKDMA(huart, hdmatx, *hdma_tx);
    __HAL_UART_DISABLE_IT(huart, UART_IT_TXE);

    HAL_NVIC_SetPriority(DMA1_Channel4_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(DMA1_Channel4_IRQn);

    callback_dma_tx = DmaCompleteCallback;
    callback_id_dma_tx = id;
}

size_t serial_tx_dma(serial_t *obj, uint8_t* buffer, size_t buffer_size)
{
    struct serial_s *obj_s = SERIAL_S(obj);
    UART_HandleTypeDef *huart = &uart_handlers[obj_s->index];

    if(HAL_UART_Transmit_DMA(huart, buffer, buffer_size) == HAL_OK) {
        return buffer_size;
    }
    return 0;
}

#endif /* DEVICE_SERIAL_ASYNCH */

#if DEVICE_SERIAL_FC

/**
 * Set HW Control Flow
 * @param obj    The serial object
 * @param type   The Control Flow type (FlowControlNone, FlowControlRTS, FlowControlCTS, FlowControlRTSCTS)
 * @param pinmap Pointer to structure which holds static pinmap
 */
#if STATIC_PINMAP_READY
#define SERIAL_SET_FC_DIRECT serial_set_flow_control_direct
void serial_set_flow_control_direct(serial_t *obj, FlowControl type, const serial_fc_pinmap_t *pinmap)
#else
#define SERIAL_SET_FC_DIRECT _serial_set_flow_control_direct
static void _serial_set_flow_control_direct(serial_t *obj, FlowControl type, const serial_fc_pinmap_t *pinmap)
#endif
{
    struct serial_s *obj_s = SERIAL_S(obj);

    if (type == FlowControlNone) {
        // Disable hardware flow control
        obj_s->hw_flow_ctl = UART_HWCONTROL_NONE;
    }
    if (type == FlowControlRTS) {
        // Enable RTS
        MBED_ASSERT(pinmap->rx_flow_pin != NC);
        obj_s->hw_flow_ctl = UART_HWCONTROL_RTS;
        obj_s->pin_rts = pinmap->rx_flow_pin;
        // Enable the pin for RTS function
        pin_function(pinmap->rx_flow_pin, pinmap->rx_flow_function);
        pin_mode(pinmap->rx_flow_pin, PullNone);
    }
    if (type == FlowControlCTS) {
        // Enable CTS
        MBED_ASSERT(pinmap->tx_flow_pin != NC);
        obj_s->hw_flow_ctl = UART_HWCONTROL_CTS;
        obj_s->pin_cts = pinmap->tx_flow_pin;
        // Enable the pin for CTS function
        pin_function(pinmap->tx_flow_pin, pinmap->tx_flow_function);
        pin_mode(pinmap->tx_flow_pin, PullNone);
    }
    if (type == FlowControlRTSCTS) {
        // Enable CTS & RTS
        MBED_ASSERT(pinmap->rx_flow_pin != NC);
        MBED_ASSERT(pinmap->tx_flow_pin != NC);
        obj_s->hw_flow_ctl = UART_HWCONTROL_RTS_CTS;
        obj_s->pin_rts = pinmap->rx_flow_pin;;
        obj_s->pin_cts = pinmap->tx_flow_pin;;
        // Enable the pin for CTS function
        pin_function(pinmap->tx_flow_pin, pinmap->tx_flow_function);
        pin_mode(pinmap->tx_flow_pin, PullNone);
        // Enable the pin for RTS function
        pin_function(pinmap->rx_flow_pin, pinmap->rx_flow_function);
        pin_mode(pinmap->rx_flow_pin, PullNone);
    }

    init_uart(obj);
}

/**
 * Set HW Control Flow
 * @param obj    The serial object
 * @param type   The Control Flow type (FlowControlNone, FlowControlRTS, FlowControlCTS, FlowControlRTSCTS)
 * @param rxflow Pin for the rxflow
 * @param txflow Pin for the txflow
 */
void serial_set_flow_control(serial_t *obj, FlowControl type, PinName rxflow, PinName txflow)
{
    struct serial_s *obj_s = SERIAL_S(obj);

    UARTName uart_rts = (UARTName)pinmap_peripheral(rxflow, PinMap_UART_RTS);
    UARTName uart_cts = (UARTName)pinmap_peripheral(txflow, PinMap_UART_CTS);

    if (((UARTName)pinmap_merge(uart_rts, obj_s->uart) == (UARTName)NC) || ((UARTName)pinmap_merge(uart_cts, obj_s->uart) == (UARTName)NC)) {
        MBED_ASSERT(0);
        return;
    }

    int peripheral = (int)pinmap_merge(uart_rts, uart_cts);

    int tx_flow_function = (int)pinmap_find_function(txflow, PinMap_UART_CTS);
    int rx_flow_function = (int)pinmap_find_function(rxflow, PinMap_UART_RTS);

    const serial_fc_pinmap_t explicit_uart_fc_pinmap = {peripheral, txflow, tx_flow_function, rxflow, rx_flow_function};

    SERIAL_SET_FC_DIRECT(obj, type, &explicit_uart_fc_pinmap);
}

#endif /* DEVICE_SERIAL_FC */

#endif /* DEVICE_SERIAL */
